# ပရိုဂရမ်ကို run ခြင်းဖြင့် ကျွန်ုပ်တို့သည် 
# ပရိုဂရမ်ထဲတွင် သတ်မှတ်ထားသော
# `FOO` ၏ တန်ဖိုးကို ရယူနိုင်ကြောင်း တွေ့ရပါသည်။ 
# သို့သော် 
# `BAR` သည် အလွတ်ဖြစ်နေပါသည်။
$ go run environment-variables.go
FOO: 1
BAR: 

# ပတ်ဝန်းကျင်ရှိ key များ၏ စာရင်းသည် 
# သင့်ကွန်ပျူတာပေါ်မူတည်၍ 
# ကွဲပြားနိုင်ပါသည်။
TERM_PROGRAM
PATH
SHELL
...
FOO

# အကယ်၍ ကျွန်ုပ်တို့သည် `BAR` ကို environment 
# တွင် ဦးစွာ သတ်မှတ်ပါက 
# run နေသော ပရိုဂရမ်သည် ထိုတန်ဖိုးကို ရယူပါလိမ့်မည်။
$ BAR=2 go run environment-variables.go
FOO: 1
BAR: 2
...