// Go မှာ `if` နှင့် `else` ကိုအသုံးပြုရတာ
// တော်တော်လေးလွယ်ကူရိုးရှင်းပါတယ်
package main

import "fmt"

func main() {

	// ဒီမှာ ဥပမာ အခြေခံ တခု။
	if 7%2 == 0 {
		fmt.Println("7 သည် စုံ ဂဏန်းဖြစ်ပါတယ်")
	} else {
		fmt.Println("7 သည် မ ဂဏန်းဖြစ်ပါတယ်")
	}

	// `if` statement ကို else မလိုဘဲအသုံးပြုနိုင်ပါတယ်။
	if 8%4 == 0 {
		fmt.Println("8 ကို 4 နှင့်စားနိုင်ပါတယ်")
	}

	// statement က conditionals အနေနဲ့အသုံးပြုနိုင်ပါတယ်။
	// statement ထဲမှာကြေငြာထားတဲ့ variable တွေက လက်ရှိနှင့်
	// နောက်ဆက်တွဲ branch တွေမှာကိုအသုံးပြုနိုင်ပါတယ်။
	if num := 9; num < 0 {
		fmt.Println(num, "က အနှုတ်တစ်ခု ဖြစ်ပါတယ်")
	} else if num < 10 {
		fmt.Println(num, "က ဂဏန်းတစ်ခုဘဲရှိပါတယ်")
	} else {
		fmt.Println(num, "က ဂဏန်းအများကြီးရှိပါတယ်")
	}
}

// မှတ်သားထားရမှာက Go မှာ အခြအနေတွေကိုစစ်ဆေးရာမှာ
// ကွင်းဖွင့်ပိတ်တွေမလိုပါဘူး။
